==================
Annotate a single node with a named string value
==================

@description("An empty node.")
()

---

(gram
  (pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (node)))

==================
Annotate a single node twice
==================

@description("an example")
@score(10)
()

---

(gram
  (pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      (annotation
        key: (symbol)
        value: (integer)))
    elements: (node)))

==================
Annotate a relationship
==================

@description("Two nodes in a relationship")
()-->()

---

(gram
  (pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (relationship
      left: (node)
      kind: (right_arrow)
      right: (node))))

==================
Annotate a node twice, stacking the annotations
==================

@title("Emptiness")
@description("An empty node.")
()

---

(gram
  (pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (node)))

==================
Annotate an empty subject
==================

@description("An empty subject.")
[]

---

(gram
  (pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (subject)))

==================
Annotate an in-line subject member is not allowed
:error
==================

[inline | @description("Member") () ]

---

(gram
  (pattern
    (pattern_element
      element: (subject
        identifier: (symbol)
        pattern: (pattern
          (pattern_element
            annotations: (annotations
              (annotation
                key: (symbol)
                value: (string_literal
                  content: (string_content))))
            element: (node)))))))
