==================
Annotate a single node with a named string value
==================

@description("An empty node.")
()

---

(gram
  (annotated_pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (node_pattern)))

==================
Annotate a single node twice
==================

@description("an example")
@score(10)
()

---

(gram
  (annotated_pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      (annotation
        key: (symbol)
        value: (integer)))
    elements: (node_pattern)))

==================
Annotate a relationship
==================

@description("Two nodes in a relationship")
()-->()

---

(gram
  (annotated_pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (relationship_pattern
      left: (node_pattern)
      kind: (right_arrow)
      right: (node_pattern))))

==================
Annotate a node twice, stacking the annotations
==================

@title("Emptiness")
@description("An empty node.")
()

---

(gram
  (annotated_pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (node_pattern)))

==================
Annotate an empty subject
==================

@description("An empty subject.")
[]

---

(gram
  (annotated_pattern
    annotations: (annotations
      (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content))))
    elements: (subject_pattern)))

==================
Annotate an in-line subject member is not allowed
:error
==================

[inline | @description("Member") () ]

---

(gram
  (annotated_pattern
    (annotated_pattern_element
      element: (subject_pattern
        identifier: (symbol)
        elements: (annotated_pattern
          (annotated_pattern_element
            annotations: (annotations
              (annotation
                key: (symbol)
                value: (string_literal
                  content: (string_content))))
            element: (node_pattern)))))))
