==================
Annotate a single node with a named string value
==================

@description("An empty node.")
()

---

(gram
  (pattern
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      element: (node))))

==================
Annotate a single node with a named string & integer value
==================

@description("an example")
@score(10)
()

---

(gram
  (pattern
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      annotations: (annotation
        key: (symbol)
        value: (integer))
      element: (node))))

==================
Annotate a relationship
==================

@description("Two nodes in a relationship")
()-->()

---

(gram
  (pattern
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      element: (relationship
        left: (node)
        kind: (right_arrow)
        right: (node)))))

==================
Annotate a node twice, stacking the annotations
==================

@title("Emptiness")
@description("An empty node.")
()

---

(gram
  (pattern
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      element: (node))))

==================
Annotate an empty subject
==================

@description("An empty subject.")
[]

---

(gram
  (pattern
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      element: (subject))))

==================
Annotate an in-line subject member
==================

[inline | @description("Member") () ]

---

(gram
  (pattern
    (pattern_element
      element: (subject
        identifier: (symbol)
        association: (pattern
          (pattern_element
            annotations: (annotation
              key: (symbol)
              value: (string_literal
                content: (string_content)))
            element: (node)))))))
