==================
Annotate a single node with a named string value
==================

@description("An empty node.")
()

---

(gram
  (pattern
    (pattern_element
      (annotation (symbol) (double_quoted_string))
      (node)
    )
  )
)

==================
Annotate a single node with a named string & integer value
==================

@description("an example")
@score(10)
()

---

(gram
  (pattern
    (pattern_element
      (annotation (symbol) (double_quoted_string))
      (annotation (symbol) (integer))
      (node)
    )
  )
)

==================
Annotate a relationship
==================

@description("Two nodes in a relationship")
()-->()

---

(gram
  (pattern
    (pattern_element
      (annotation (symbol) (double_quoted_string))
      (relationship
        (node)
        (right)
        (node)
      )
    )
  )
)

==================
Annotate a node twice, stacking the annotations
==================

@title("Emptiness")
@description("An empty node.")
()

---

(gram
  (pattern
    (pattern_element 
      (annotation (symbol) (double_quoted_string))
      (annotation (symbol) (double_quoted_string))
      (node)
    )
  )
)

==================
Annotate an empty subject
==================

@description("An empty subject.")
[]

---

(gram
  (pattern
    (pattern_element
      (annotation (symbol) (double_quoted_string))
      (subject)
    )
  )
)


==================
Annotate an in-line subject member
==================

[inline | @description("Member") () ]

---

(gram
  (pattern
    (pattern_element (subject
      (symbol)
      (pattern
        (pattern_element
          (annotation (symbol) (double_quoted_string))
          (node)
        )
      )
    ))
  )
)

