==================
Empty relationships: Single relationship pattern
==================

()-->()

---

(gram
  (pattern
    (pattern_element (relationship 
      (node)
      (right)
      (node)
    ))
  )
)

==================
Empty relationships: Two relationship patterns
==================

()-->()
()<--()

---

(gram
  (pattern
    (pattern_element (relationship (node) (right) (node)))
  )
  (pattern
    (pattern_element (relationship (node) (left) (node)))
  )
)

==================
Empty relationships: Pair of relationships in a single pattern
==================

()-->(), ()<--()

---

(gram
  (pattern
    (pattern_element (relationship (node) (right) (node)))
    (pattern_element (relationship (node) (left) (node)))
  )
)

==================
Empty relationships: Pattern with a relationship and isolated node
==================

()-->(), ()

---

(gram
  (pattern
    (pattern_element (relationship (node) (right) (node)))
    (pattern_element (node))
  )
)

==================
Empty relationships: Three node path
==================

()-->()-->()

---

(gram
  (pattern
    (pattern_element (relationship 
      (node)
      (right)
      (relationship
        (node)
        (right)
        (node)
      )
    ))
  )
)
