==================
Empty relationships: Single relationship pattern
==================

()-->()

---

(gram
  (pattern
    (part (node)
      (single_arrow_right)
      (node)
    )
  )
)

==================
Empty relationships: Two relationship patterns
==================

()-->()
()<--()

---

(gram
  (pattern
    (part (node)
      (single_arrow_right)
      (node)
    )
  )
  (pattern
    (part (node)
      (single_arrow_left)
      (node)
    )
  )
)

==================
Empty relationships: Pair of relationships in a single pattern
==================

()-->(), ()<--()

---

(gram
  (pattern
    (part (node)
      (single_arrow_right)
      (node)
    )
    (part (node)
      (single_arrow_left)
      (node)
    )
  )
)

==================
Empty relationships: Three segment pattern
==================

()-->(), ()<--(), ()

---

(gram
  (pattern
    (part (node)
      (single_arrow_right)
      (node)
    )
    (part (node)
      (single_arrow_left)
      (node)
    )
    (part (node))
  )
)
