==================
Graph: top-level record
==================

{ name : "Gram Graph", created : date`2024-04-05` }

---

(gram_pattern
  root: (record
    (record_property
      key: (symbol)
      value: (string_literal
        content: (string_content)))
    (record_property
      key: (symbol)
      value: (tagged_string
        tag: (symbol)
        content: (string_content)))))

==================
Graph: top-level record and a node
==================

{ name : "Gram Graph", created : date`2024-04-05` }

(n)

---

(gram_pattern
  root: (record
    (record_property
      key: (symbol)
      value: (string_literal
        content: (string_content)))
    (record_property
      key: (symbol)
      value: (tagged_string
        tag: (symbol)
        content: (string_content))))
  (node_pattern
      identifier: (symbol)))

==================
Graph: top-level record and a path
==================

{ name : "Gram Graph", created : date`2024-04-05` }

(n)~~>(m)

---

(gram_pattern
  root: (record
    (record_property
      key: (symbol)
      value: (string_literal
        content: (string_content)))
    (record_property
      key: (symbol)
      value: (tagged_string
        tag: (symbol)
        content: (string_content))))
  (relationship_pattern
      left: (node_pattern
        identifier: (symbol))
      kind: (right_arrow)
      right: (node_pattern
        identifier: (symbol))))

==================
Graph: top-level record, a path and a path
==================

{ name : "Gram Graph", created : date`2024-04-05` }

(n)~~>(m)

[s | n, m]

---

(gram_pattern
  root: (record
    (record_property
      key: (symbol)
      value: (string_literal
        content: (string_content)))
    (record_property
      key: (symbol)
      value: (tagged_string
        tag: (symbol)
        content: (string_content))))
  (relationship_pattern
      left: (node_pattern
        identifier: (symbol))
      kind: (right_arrow)
      right: (node_pattern
        identifier: (symbol)))
  (subject_pattern
      identifier: (symbol)
      elements: (subject_pattern_elements
        (pattern_reference
          identifier: (symbol))
        (pattern_reference
          identifier: (symbol))))
)
