
==================
Identifier using '@'
==================

(akollegger@neo4j.com)

---

(gram
  (pattern (node (symbol)))
)


==================
Identifier using snakecase '_' and mixed case
==================

(_0n96pdf6@E)
(Im0_pWk0g4@@)

---

(gram
  (pattern (node (symbol)))
  (pattern (node (symbol)))
)


==================
Identifier using kebabcase '-' and mixed case
==================

(hello-there)

---

(gram
  (pattern (node (symbol)))
)


==================
Identifier using numbers
==================

(42)

---

(gram
  (pattern (node (integer)))
)


==================
Identifier using numbers with units
==================

(12px)

---

(gram
  (pattern (node (measurement)))
)


==================
Identifier using backticks
==================

(`+1`)

---

(gram
  (pattern (node (backticked_string)))
)


==================
Identifier using backticks with escaped backtick
==================

(`escape \` the backtick`)

---

(gram
  (pattern (node (backticked_string)))
)

==================
Identifier using double-quotes
==================

("Hello World!")

---

(gram
  (pattern (node (double_quoted_string)))
)



==================
Identifier using double-quotes with escaped double-quote
==================

("escape \" the double-quote")

---

(gram
  (pattern (node (double_quoted_string)))
)

==================
Identifier pair
==================

(a),(b)

---

(gram
  (pattern 
    (node (symbol))
    (node (symbol))
  )
)

