==================
Identifier cannot start with '@'
:error
==================

(@neo4j.com)

---



==================
Identifier can use '@' after first character
==================

(akollegger@neo4j.com)

---

(gram
  (pattern
    elements: (node
      identifier: (symbol))))

==================
Identifier using snakecase '_' and mixed case
==================

(_0n96pdf6E)
(Im0_pWk0g4)

---

(gram
  (pattern
    elements: (node
      identifier: (symbol)))
  (pattern
    elements: (node
      identifier: (symbol))))

==================
Identifier using kebabcase '-' and mixed case
==================

(hello-there)

---

(gram
  (pattern
    elements: (node
      identifier: (symbol))))

==================
Identifier using numbers
==================

(42)

---

(gram
  (pattern
    elements: (node
      identifier: (integer))))

==================
Identifier using numbers with units are not allowed
:error
==================

(12px)

---

(gram
  (pattern
    elements: (node
      identifier: (measurement))))

==================
Identifier using backticks
==================

(`+1`)

---

(gram
  (pattern
    elements: (node
      identifier: (string_literal
        content: (string_content)))))

==================
Identifier using backticks with escaped backtick
==================

(`escape \` the backtick`)

---

(gram
  (pattern
    elements: (node
      identifier: (string_literal
        content: (string_content)))))

==================
Identifier using double-quotes
==================

("Hello World!")

---

(gram
  (pattern
    elements: (node
      identifier: (string_literal
        content: (string_content)))))

==================
Identifier using double-quotes with escaped double-quote
==================

("escape \" the double-quote")

---

(gram
  (pattern
    elements: (node
      identifier: (string_literal
        content: (string_content)))))
