
==================
Identifier using '@'
==================

(@akollegger)
(akollegger@neo4j.com)

---

(gram
  (pattern (part (node (attributes (symbol)))))
  (pattern (part (node (attributes (symbol)))))
)


==================
Identifier using '_' and mixed case
==================

(_0n96pdf6@E)
(Im0_pWk0g4@@)

---

(gram
  (pattern (part (node (attributes (symbol)))))
  (pattern (part (node (attributes (symbol)))))
)


==================
Identifier using numbers
==================

(42)

---

(gram
  (pattern (part (node (attributes (symbol)))))
)


==================
Identifier using numbers with units
==================

(12px)

---

(gram
  (pattern (part (node (attributes (symbol)))))
)


==================
Identifier using backticks
==================

(`+1`)

---

(gram
  (pattern (part (node (attributes (backticked_string)))))
)



==================
Identifier using backticks with escaped backtick
==================

(`escape \` the backtick`)

---

(gram
  (pattern (part (node (attributes (backticked_string)))))
)

==================
Identifier using double-quotes
==================

("Hello World!")

---

(gram
  (pattern (part (node (attributes (double_quoted_string)))))
)



==================
Identifier using double-quotes with escaped double-quote
==================

("escape \" the double-quote")

---

(gram
  (pattern (part (node (attributes (double_quoted_string)))))
)

==================
Identifier pair
==================

(a),(b)

---

(gram
  (pattern 
    (part (node (attributes (symbol))))
    (part (node (attributes (symbol))))
  )
)

