==================
Labeled nodes: No label
==================

()

---

(gram
  (annotated_pattern
    elements: (node_pattern)))

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (annotated_pattern
    elements: (node_pattern
      labels: (labels
        (symbol)))))

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (annotated_pattern
    elements: (node_pattern
      labels: (labels
        (symbol)
        (symbol)))))

==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (annotated_pattern
    elements: (node_pattern
      identifier: (integer)
      labels: (labels
        (symbol)
        (symbol)))))
