==================
Labeled nodes: No label
==================

()

---

(gram
  (pattern
    elements: (node)))

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (pattern
    elements: (node
      labels: (labels
        (symbol)))))

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (pattern
    elements: (node
      labels: (labels
        (symbol)
        (symbol)))))

==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (pattern
    elements: (node
      identifier: (integer)
      labels: (labels
        (symbol)
        (symbol)))))
