==================
Labeled nodes: No label
==================

()

---

(gram
  (pattern
    (node)
  )
)

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (pattern
    (node (labels (symbol)))
  )
)

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (pattern
    (node (labels (symbol) (symbol)))
  )
)


==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (pattern
    (node (integer) (labels (symbol) (symbol)))
  )
)