==================
Labeled nodes: No label
==================

()

---

(gram
  (pattern
    (path (node))
  )
)

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (pattern
    (path (node (attributes (labels (symbol)))))
  )
)

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (pattern
    (path (node (attributes (labels (symbol) (symbol)))))
  )
)


==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (pattern
    (path (node (attributes (symbol) (labels (symbol) (symbol)))))
  )
)