==================
Labeled nodes: No label
==================

()

---

(gram
  (pattern
    (pattern_element (node))
  )
)

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (pattern
    (pattern_element (node (labels (label (binder) (symbol)))))
  )
)

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (pattern
    (pattern_element (node (labels (label (binder) (symbol)) (label (binder) (symbol)))))
  )
)


==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (pattern
    (pattern_element (node (integer) (labels (label (binder) (symbol)) (label (binder) (symbol)))))
  )
)