==================
Labeled nodes: No label
==================

()

---

(gram
  (pattern
    (pattern_element
      element: (node))))

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (pattern
    (pattern_element
      element: (node
        labels: (labels
          (symbol))))))

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (pattern
    (pattern_element
      element: (node
        labels: (labels
          (symbol)
          (symbol))))))

==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (pattern
    (pattern_element
      element: (node
        identifier: (integer)
        labels: (labels
          (symbol)
          (symbol))))))
