==================
Labeled nodes: No label
==================

()

---

(gram
  (pattern
    (pattern_element (node))
  )
)

==================
Labeled nodes: Single label
==================

(:A)

---

(gram
  (pattern
    (pattern_element (node (labels (symbol))))
  )
)

==================
Labeled nodes: Two labels
==================

(:A:B)

---

(gram
  (pattern
    (pattern_element (node (labels (symbol) (symbol))))
  )
)


==================
Labeled nodes: Identity followed by labels
==================

(1:A:B)

---

(gram
  (pattern
    (pattern_element (node (integer) (labels (symbol) (symbol))))
  )
)