==================
Node empty
==================

()

---

(gram
  (pattern
    (node)
  )
)

==================
Node with empty record 
==================

({})

---

(gram
  (pattern
    (node (record))
  )
)

==================
Node with record
==================

({ k : "v" })

---

(gram
  (pattern
    (node (record 
      (property (symbol) (double_quoted_string)) 
    ))
  )
)


==================
Node identified and with a record
==================

(player1 { named : "it" })

---

(gram
  (pattern
    (node 
      (symbol)
      (record (property (symbol) (double_quoted_string))))
  )
)


==================
Node identified, labeled and with a record
==================

(player1:Player { named : "it" })

---

(gram
  (pattern
    (node 
      (symbol)
      (labels (symbol))
      (record (property (symbol) (double_quoted_string))))
  )
)

