==================
Pattern: Single member subject
==================

[]

---

(gram
  (pattern
    (pattern_element
      element: (subject))))

==================
Pattern: single member node
==================

()

---

(gram
  (pattern
    (pattern_element
      element: (node))))

==================
Pattern: Two node members
==================

(),()

---

(gram
  (pattern
    (pattern_element
      element: (node))
    (pattern_element
      element: (node))))

==================
Pattern: one relationship
==================

()-->()

---

(gram
  (pattern
    (pattern_element
      element: (relationship
        left: (node)
        kind: (right_arrow)
        right: (node)))))

==================
Pattern: 2 single-hop relationships
==================

()-->(), ()-->()

---

(gram
  (pattern
    (pattern_element
      element: (relationship
        left: (node)
        kind: (right_arrow)
        right: (node)))
    (pattern_element
      element: (relationship
        left: (node)
        kind: (right_arrow)
        right: (node)))))

==================
Pattern: two-hop path
==================

()-->()-->()

---

(gram
  (pattern
    (pattern_element
      element: (relationship
        left: (node)
        kind: (right_arrow)
        right: (relationship
          left: (node)
          kind: (right_arrow)
          right: (node))))))

==================
Pattern: 2 annotated nodes
==================

@description("first empty node") (), 
@description("second empty node") ()

---

(gram
  (pattern
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      element: (node))
    (pattern_element
      annotations: (annotation
        key: (symbol)
        value: (string_literal
          content: (string_content)))
      element: (node))))
