==================
Pattern: Single member subject
==================

[]

---

(gram
  (pattern
    elements: (subject)))

==================
Pattern: single member node
==================

()

---

(gram
  (pattern
    elements: (node)))

==================
Pattern: Two node members
==================

(),()

---

(gram
  (pattern
    elements: (node)
    elements: (node)))

==================
Pattern: one relationship
==================

()-->()

---

(gram
  (pattern
    elements: (relationship
      left: (node)
      kind: (right_arrow)
      right: (node))))

==================
Pattern: 2 single-hop relationships
==================

()-->(), ()-->()

---

(gram
  (pattern
    elements: (relationship
      left: (node)
      kind: (right_arrow)
      right: (node))
    elements: (relationship
      left: (node)
      kind: (right_arrow)
      right: (node))))

==================
Pattern: two-hop path
==================

()-->()-->()

---

(gram
  (pattern
    elements: (relationship
      left: (node)
      kind: (right_arrow)
      right: (relationship
        left: (node)
        kind: (right_arrow)
        right: (node)))))

==================
Pattern: 2 annotated nodes is not allowed. annotation applies to the complete pattern, not individual elements within the pattern
:error
==================

@description("first empty node") (),
@description("second empty node") ()

---
