==================
Pattern: Single member subject
==================

[]

---

(gram
  (annotated_pattern
    elements: (subject_pattern)))

==================
Pattern: single member node
==================

()

---

(gram
  (annotated_pattern
    elements: (node_pattern)))

==================
Pattern: Two node members
==================

(),()

---

(gram
  (annotated_pattern
    elements: (node_pattern)
    elements: (node_pattern)))

==================
Pattern: one relationship
==================

()-->()

---

(gram
  (annotated_pattern
    elements: (relationship_pattern
      left: (node_pattern)
      kind: (right_arrow)
      right: (node_pattern))))

==================
Pattern: 2 single-hop relationships
==================

()-->(), ()-->()

---

(gram
  (annotated_pattern
    elements: (relationship_pattern
      left: (node_pattern)
      kind: (right_arrow)
      right: (node_pattern))
    elements: (relationship_pattern
      left: (node_pattern)
      kind: (right_arrow)
      right: (node_pattern))))

==================
Pattern: two-hop path
==================

()-->()-->()

---

(gram
  (annotated_pattern
    elements: (relationship_pattern
      left: (node_pattern)
      kind: (right_arrow)
      right: (relationship_pattern
        left: (node_pattern)
        kind: (right_arrow)
        right: (node_pattern)))))

==================
Pattern: 2 annotated nodes is not allowed. annotation applies to the complete pattern, not individual elements within the pattern
:error
==================

@description("first empty node") (),
@description("second empty node") ()

---
