==================
Pattern: Single member subject
==================

[]

---

(gram
  (pattern
    (pattern_element (subject))
  )
)

==================
Pattern: single member node
==================

()

---

(gram
  (pattern
    (pattern_element (node))
  )
)

==================
Pattern: Two node members
==================

(),()

---

(gram
  (pattern
    (pattern_element (node))
    (pattern_element (node))
  )
)

==================
Pattern: one relationship
==================

()-->()

---

(gram
  (pattern
    (pattern_element (relationship
      (node)
      (right)
      (node)
    ))
  )
)


==================
Pattern: 2 single-hop relationships
==================

()-->(), ()-->()

---

(gram
  (pattern
    (pattern_element (relationship
      (node)
      (right)
      (node)
    ))
    (pattern_element (relationship
      (node)
      (right)
      (node)
    ))
  )
)


==================
Pattern: two-hop path
==================

()-->()-->()

---

(gram
  (pattern
    (pattern_element (relationship
      (node)
      (right)
      (relationship
        (node)
        (right)
        (node)
      )
    ))
  )
)




==================
Pattern: 2 annotated nodes
==================

@description("first empty node") (), 
@description("second empty node") ()

---

(gram
  (pattern
    (pattern_element
      (annotation (symbol) (double_quoted_string))
      (node)
    )
    (pattern_element
      (annotation (symbol) (double_quoted_string))
      (node)
    )

  )
)

