==================
Pattern: empty subject 
==================

[]

---

(gram
  (pattern
    (subject)
  )
)

==================
Pattern: empty node 
==================

()

---

(gram
  (pattern
    (node)
  )
)

==================
Pattern: two nodes
==================

(),()

---

(gram
  (pattern
    (node) (node)
  )
)

==================
Pattern: 1 single-hop relationship 
==================

()-->()

---

(gram
  (pattern
    (relationship
      (node)
      (single_right)
      (node)
    )
  )
)


==================
Pattern: 2 single-hop relationships
==================

()-->(), ()-->()

---

(gram
  (pattern
    (relationship
      (node)
      (single_right)
      (node)
    )
    (relationship
      (node)
      (single_right)
      (node)
    )

  )
)