==================
Pattern: Empty
==================

[]

---

(gram
  (pattern
    (subject)
  )
)

==================
Pattern: Named series, empty
==================

()

---

(gram
  (pattern
    (node)
  )
)

==================
Pattern: Named series with identified members
==================

(),()

---

(gram
  (pattern
    (node) (node)
  )
)

==================
Pattern: Named series with in-line members
==================

()-->()

---

(gram
  (pattern
    (relationship
      (node)
      (single_right)
      (node)
    )
  )
)


==================
Pattern: 2 single-hop relationships
==================

()-->(), ()-->()

---

(gram
  (pattern
    (relationship
      (node)
      (single_right)
      (node)
    )
    (relationship
      (node)
      (single_right)
      (node)
    )

  )
)

