==================
Record: No record
==================

()

---

(gram
  (pattern
    (part (node))
  )
)

==================
Record: empty
:error
==================

({})

---

(gram
  (pattern
    (part (node (attributes (labels (symbol)))))
  )
)

==================
Record: number properties
==================

({ n : 1, m : 2 })

---

(gram
  (pattern
    (part (node (attributes (record 
      (pair (symbol) (integer)) 
      (pair (symbol) (integer)) 
    ) ) ) )
  )
)

==================
Record: double-quoted string property
==================

({ s : "a" })

---

(gram
  (pattern
    (part (node (attributes (record (pair (symbol) (double_quoted_string)) ) ) ) )
  )
)

==================
Record: single-quoted string property
==================

({ s : 'a' })

---

(gram
  (pattern
    (part (node (attributes (record (pair (symbol) (single_quoted_string)) ) ) ) )
  )
)

==================
Record: backtick-quoted string property
==================

({ s : `a` })

---

(gram
  (pattern
    (part (node (attributes (record (pair (symbol) (backticked_string)) ) ) ) )
  )
)


==================
Record: weird characters in string property
==================

({ s : 'ðŸ˜€ Ã¸â„¢Âµ âš›ï¸Žâ™˜' })
---

(gram
  (pattern
    (part (node (attributes (record (pair (symbol) (single_quoted_string)) ) ) ) )
  )
)


==================
Record: tagged string properties
==================

({  t1 : url`http://somewhere.org`,
    t2 : md`# Title\nFirst paragraph about something.`,
    t3 : date`2024-04-05`,
    t4 : week`2024W35`,
    t5 : weekDate`2024W35-5`,
    t6 : time`17:35`,
    t7 : time`17:42:03.149`,
    t8 : duration`PT2H3M42S`,
    t9 : point`30 10`
})

---

(gram
  (pattern
    (part (node (attributes (record 
      (pair (symbol) (tagged_string))
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
      (pair (symbol) (tagged_string)) 
    ) ) ) )
  )
)