==================
Record empty
==================

{}

---

(gram
  (record)
)

==================
Record with integer property
==================

{ n : 1 }

---

(gram
  (record (property (symbol) (binder) (integer)) 
  )
)

==================
Record with double-quoted string property
==================

{ s : "a" }

---

(gram
  (record (property (symbol) (binder) (double_quoted_string)))
)

==================
Record with declare separator and a symbol property
==================

{ s :: string }

---

(gram
  (record (property (symbol) (binder) (symbol)))
)

==================
Record followed by a Node
==================

{ s : "a" }

()

---

(gram
  (record (property (symbol) (binder) (double_quoted_string)))
  (pattern (pattern_element (node)))
)

==================
Record property may not us greater than operator
:error
==================

{ n > 1 }

---

