==================
Record empty
==================

{}

---

(gram
  (record)
)

==================
Record with integer property
==================

{ n : 1 }

---

(gram
  (record (property (symbol) (integer)) 
  )
)

==================
Record with double-quoted string property
==================

{ s : "a" }

---

(gram
  (record (property (symbol) (double_quoted_string)))
)

==================
Record with symbol property
==================

{ s : string }

---

(gram
  (record (property (symbol) (symbol)))
)

==================
Record followed by a Node
==================

{ s : "a" }

()

---

(gram
  (record (property (symbol) (double_quoted_string)))
  (pattern (node))
)

==================
Record with greater than operator
==================

{ n > 1 }

---

(gram
  (record (property (symbol) (integer)) )
)
