==================
Record: No record
==================

()

---

(gram
  (pattern
    (node)
  )
)

==================
Record: empty
:error
==================

({})

---

(gram
  (pattern
    (node (labels (symbol)))
  )
)

==================
Record: number properties
==================

({ n : 1, m : 2 })

---

(gram
  (pattern
    (node (record 
      (value_pair (symbol) (integer)) 
      (value_pair (symbol) (integer)) 
    ))
  )
)

==================
Record: double-quoted string properties
==================

({ s : "a" })

---

(gram
  (pattern
    (node (record (value_pair (symbol) (double_quoted_string))))
  )
)

==================
Record: type pair
==================

({ s :: string })

---

(gram
  (pattern
    (node (record (value_pair (symbol) (symbol))))
  )
)


==================
Record: arbitrary type pair
==================

({ s :: abk })

---

(gram
  (pattern
    (node (record (value_pair (symbol) (symbol))))
  )
)

==================
Record: identified and with a record
==================

(player1 { named : "it" })

---

(gram
  (pattern
    (node 
      (symbol)
      (record (value_pair (symbol) (double_quoted_string))))
  )
)


==================
Record: identified, labeled and with a record
==================

(player1:Player { named : "it" })

---

(gram
  (pattern
    (node 
      (symbol)
      (labels (symbol))
      (record (value_pair (symbol) (double_quoted_string))))
  )
)

==================
Record: labeled with a record stating a type
==================

(:Player { named :: string })

---

(gram
  (pattern
    (node 
      (labels (symbol))
      (record (value_pair (symbol) (symbol))))
  )
)
