==================
Series: Empty
==================

[]

---

(gram
  (series)
)

==================
Series: Named series, empty
==================

[a]

---

(gram
  (series (symbol))
)


==================
Series: Named series with identified members
==================

[letters | a,b,c] 

---

(gram
  (series 
    (symbol)
    (members (symbol) (symbol) (symbol))
  )
)


==================
Series: Named series with in-line members
==================

[letters | (a),(b),(c)] 

---

(gram
  (series 
    (symbol)
    (members 
      (node (symbol))
      (node (symbol))
      (node (symbol))
    )
  )
)

