==================
Series: Empty
==================

[]

---

(gram
  (series)
)

==================
Series: Named series, empty
==================

[a]

---

(gram
  (series (attributes (symbol)))
)


==================
Series: Named series with identified members
==================

[letters | a,b,c] 

---

(gram
  (series 
    (attributes (symbol))
    (members (symbol) (symbol) (symbol))
  )
)


==================
Series: Named series with in-line members
==================

[letters | (a),(b),(c)] 

---

(gram
  (series 
    (attributes (symbol))
    (members 
      (path (node (attributes (symbol))))
      (path (node (attributes (symbol))))
      (path (node (attributes (symbol))))
    )
  )
)

