==================
Series: Empty
==================

[]

---

(gram
  (series)
)

==================
Series: Named series
==================

[a]

---

(gram
  (series (attributes (symbol)))
)


==================
Series: Named series with members
==================

[letters | a,b,c] 

---

(gram
  (series 
    (attributes (symbol))
    (members (symbol) (symbol) (symbol))
  )
)

==================
Series: Named series with members
==================

[numbers | 1,2,3] 

---

(gram
  (series 
    (attributes (symbol))
    (members (symbol) (symbol) (symbol))
  )
)

