==================
Hello world
==================

(hello)-->(world)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right)
      (node (symbol))
    ))
  )
)

==================
Hello dear world
==================

(hello)-[dear]->(world)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right (symbol))
      (node (symbol))
    ))
  )
)

==================
Hello dear world over there
==================

(hello)-[dear]->(world)-[over]->(there)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right (symbol))
      (relationship
        (node (symbol))
        (right (symbol))
        (node (symbol))
      )
    ))
  )
)

==================
Hello "dear world" "over there"
==================

(hello)-[`dear world`]->(`over there`)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right (backticked_string))
      (node (backticked_string))
    ))
  )
)
