==================
Hello world
==================

(hello)-->(world)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right_arrow)
      (node (symbol))
    ))
  )
)

==================
Hello dear world
==================

(hello)-[dear]->(world)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right_arrow (symbol))
      (node (symbol))
    ))
  )
)

==================
Hello dear world over there
==================

(hello)-[dear]->(world)-[over]->(there)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right_arrow (symbol))
      (relationship
        (node (symbol))
        (right_arrow (symbol))
        (node (symbol))
      )
    ))
  )
)

==================
Hello "dear world" "over there"
==================

(hello)-[`dear world`]->(`over there`)

---

(gram
  (pattern
    (pattern_element (relationship
      (node (symbol))
      (right_arrow (string_literal))
      (node (string_literal))
    ))
  )
)
